{
  "Conditions": {
    "Applications": {
      "ExcludeApplications": [],
      "IncludeApplications": [
        "All"
      ],
      "IncludeAuthenticationContextClassReferences": [],
      "IncludeUserActions": []
    },
    "ClientAppTypes": [
      "exchangeActiveSync",
      "other"
    ],
    "ServicePrincipalRiskLevels": [],
    "SignInRiskLevels": [],
    "UserRiskLevels": [],
    "Users": {
      "ExcludeGroups": [
        "<<breakGlass_Group>>"
      ],
      "ExcludeRoles": [],
      "ExcludeUsers": [],
      "IncludeGroups": [],
      "IncludeRoles": [],
      "IncludeUsers": [
        "All"
      ]
    }
  },
  "DisplayName": "CA004: Block legacy authentication",
  "GrantControls": {
    "BuiltInControls": [
      "block"
    ],
    "CustomAuthenticationFactors": [],
    "Operator": "OR",
    "TermsOfUse": []
  },
  "State": "enabledForReportingButNotEnforced"
}
